<?php
/*
使用for迴圈來產生以下的數列

1,3,5,7,9……n
10,20,30,40,50,60……n
3,5,7,11,13,17……97
*/
?>
<h3>請使用for迴圈來產生1,3,5,7,9……n數列</h3>
<?php
$n=100;
$count=0;
for($i=1;$i<$n;$i=$i+2){
    $count++;
    echo $i . ",";
}
echo "<br>";
echo "迴圈數:".$count;
?>
<hr>
<h3>請使用for迴圈來產生10,20,30,40,50,60……n數列</h3>
<?php
for($i=10;$i<$n;$i=$i+10){
    $count++;
    echo $i . ",";
}
echo "<br>";
echo "迴圈數:".$count;
?>

<hr>
<h3>請使用for迴圈來產生3,5,7,11,13,17……97數列(質數數列)</h3>
<p>質數，除了1和自己以外，沒有其他的因數</p>
<p>所以先從1開始除除到他自己，中間若沒任何數可整除(餘數=0)就是質數</p>
<p>2是最小的質數</p>

<?php
for ($i = 3; $i < 100; $i++) {
    $test = false; //表示質數，預設是false
    for ($j = 2; $j < $i; $j++) {
        // ↑用小於，是因為我們不用自己($i)當分母($j)
        if ($i % $j == 0) {
            $test = true; //表示不是質數
        }
    }
    // ↓只印出那些餘數不會是0的數，就是質數啦
    if ($test == false) {
        echo $i . ",";
    }
}
echo "<hr>";
?>

<h3>前後2數之差構成等比數列</h3>
<?php
for ($i = 3; $i < 100; $i = $i * 2 + 1) {
    echo $i . ",";
}
?>